#include "Skin.h"

unordered_map<int , EconomyItemCfg> g_SkinChangerCfg;
unordered_map<int , const char*> g_ViewModelCfg;
unordered_map<const char* , const char*> g_KillIconCfg;

char* pWeaponData[33] =
{
	// 0 - 9
	WEAPON_DEAGLE_STR,WEAPON_ELITE_STR,WEAPON_FIVESEVEN_STR,
	WEAPON_GLOCK_STR,WEAPON_HKP2000_STR,WEAPON_P250_STR,
	WEAPON_USP_S_STR,WEAPON_CZ75A_STR,WEAPON_REVOLVER_STR,
	WEAPON_TEC9_STR,
	// ÀÂÒÎÌÀÒÛ - 10 - 30
	WEAPON_AK47_STR,WEAPON_AUG_STR,WEAPON_FAMAS_STR,WEAPON_GALILAR_STR,
	WEAPON_M249_STR,WEAPON_M4A1_STR,WEAPON_M4A1_S_STR,WEAPON_MAC10_STR,
	WEAPON_P90_STR,WEAPON_UMP45_STR,WEAPON_XM1014_STR,WEAPON_BIZON_STR,
	WEAPON_MAG7_STR,WEAPON_NEGEV_STR,WEAPON_SAWEDOFF_STR,
	WEAPON_MP7_STR,WEAPON_MP9_STR,WEAPON_NOVA_STR,WEAPON_SG553_STR,
	WEAPON_SCAR20_STR,WEAPON_G3SG1_STR,
	// ÑÍÀÉÏÅÐÊÈ  - 31 - 32
	WEAPON_AWP_STR,WEAPON_SSG08_STR
};

int pWeaponItemIndexData[33] =
{
	// - 0 - 9
	WEAPON_DEAGLE,WEAPON_ELITE,WEAPON_FIVESEVEN,
	WEAPON_GLOCK,WEAPON_HKP2000,WEAPON_P250,
	WEAPON_USP_SILENCER,WEAPON_CZ75A,WEAPON_REVOLVER,
	WEAPON_TEC9,
	// ÀÂÒÎÌÀÒÛ - 10 - 30
	WEAPON_AK47,WEAPON_AUG,WEAPON_FAMAS,WEAPON_GALILAR,
	WEAPON_M249,WEAPON_M4A1,WEAPON_M4A1_SILENCER,WEAPON_MAC10,
	WEAPON_P90,WEAPON_UMP45,WEAPON_XM1014,WEAPON_BIZON,
	WEAPON_MAG7,WEAPON_NEGEV,WEAPON_SAWEDOFF,
	WEAPON_MP7,WEAPON_MP9,WEAPON_NOVA,WEAPON_SG553,
	WEAPON_SCAR20,WEAPON_G3SG1,
	// ÑÍÀÉÏÅÐÊÈ  - 31 - 32
	WEAPON_AWP,WEAPON_SSG08
};

char* pKnifeData[10] =
{

		pSkins->Release();
	}

	delete pSkins;

	SetSkinConfig();
	SetKillIconCfg();

	for (ClientClass* pClass = Interfaces::Client()->GetAllClasses(); pClass; pClass = pClass->m_pNext)
	{
		if (!strcmp(pClass->m_pNetworkName, "CBaseViewModel"))
		{
			RecvTable* pClassTable = pClass->m_pRecvTable;

			for (int nIndex = 0; nIndex < pClassTable->m_nProps; nIndex++)
			{
				RecvProp* pProp = &pClassTable->m_pProps[nIndex];

				if (!pProp || strcmp(pProp->m_pVarName, "m_nSequence"))
					continue;

				fnSequenceProxyFn = pProp->m_ProxyFn;
				pProp->m_ProxyFn = (RecvVarProxyFn)Hook_SetViewModelSequence;

				break;
			}

			break;
		}
	}
}

bool CSkin::ApplyCustomSkin(CBaseAttributableItem* pWeapon, int nWeaponIndex)
{
	if (g_SkinChangerCfg.find(nWeaponIndex) == g_SkinChangerCfg.end())
		return false;

	*pWeapon->GetFallbackPaintKit() = g_SkinChangerCfg[nWeaponIndex].nFallbackPaintKit;
	*pWeapon->GetEntityQuality() = g_SkinChangerCfg[nWeaponIndex].iEntityQuality;
	*pWeapon->GetFallbackStatTrak() = g_SkinChangerCfg[nWeaponIndex].nFallbackStatTrak;
	*pWeapon->GetFallbackWear() = g_SkinChangerCfg[nWeaponIndex].flFallbackWear;

	if (g_SkinChangerCfg[nWeaponIndex].iItemDefinitionIndex)
	{
		*pWeapon->GetItemDefinitionIndex() = g_SkinChangerCfg[nWeaponIndex].iItemDefinitionIndex;
	}

	*pWeapon->GetItemIDHigh() = -1;

	return true;
}

bool CSkin::ApplyCustomModel(CBaseEntity* pLocal, CBaseAttributableItem* pWeapon)
{
	CBaseViewModel* pViewModel = pLocal->GetViewModel();

	if (!pViewModel)
		return false;

	DWORD hViewModelWeapon = pViewModel->GetWeapon();

	CBaseAttributableItem* pViewModelWeapon = (CBaseAttributableItem*)Interfaces::EntityList()->GetClientEntityFromHandle((PVOID)hViewModelWeapon);

	if (pViewModelWeapon != pWeapon)
		return false;

	int nViewModelIndex = pViewModel->GetModelIndex();

	if (!nViewModelIndex)
		return false;

	if (g_ViewModelCfg.find(nViewModelIndex) == g_ViewModelCfg.end())
		return false;

	pViewModel->SetModelIndex(Interfaces::ModelInfo()->GetModelIndex(g_ViewModelCfg[nViewModelIndex]));

	return true;
}

bool CSkin::ApplyCustomKillIcon(IGameEvent* pEvent)
{
	int nUserID = pEvent->GetInt("attacker");

	if (!nUserID)
		return false;

	if (Interfaces::Engine()->GetPlayerForUserID(nUserID) != Interfaces::Engine()->GetLocalPlayer())
		return false;

	const char* szWeapon = pEvent->GetString("weapon");

	for (auto ReplacementIcon : g_KillIconCfg)
	{
		if (!strcmp(szWeapon, ReplacementIcon.first))
		{
			pEvent->SetString("weapon", ReplacementIcon.second);
			break;
		}
	}

	return true;
}

bool IsCodePtr(void* ptr)
{
	constexpr const DWORD protect_flags = PAGE_EXECUTE | PAGE_EXECUTE_READ | PAGE_EXECUTE_READWRITE | PAGE_EXECUTE_WRITECOPY;

	MEMORY_BASIC_INFORMATION out;
	VirtualQuery(ptr, &out, sizeof out);

	return out.Type
		&& !(out.Protect & (PAGE_GUARD | PAGE_NOACCESS))
		&& out.Protect & protect_flags;
}

enum class EStickerAttributeType
{
	Index,
	Wear,
	Scale,
	Rotation
};

DWORD dwEconItemInterfaceWrapper = 0x2DB0 + 0xC;

typedef float(__thiscall* GetStickerAttributeBySlotIndexFloatFn)(void*, int, EStickerAttributeType, float);
GetStickerAttributeBySlotIndexFloatFn oGetStickerAttributeBySlotIndexFloat;

float __fastcall Hooked_GetStickerAttributeBySlotIndexFloat(void* thisptr, void* edx, int iSlot, EStickerAttributeType iAttribute, float flUnknown)
{
	auto pItem = reinterpret_cast<CBaseAttributableItem*>(uintptr_t(thisptr) - dwEconItemInterfaceWrapper);
	if (!pItem)
		return oGetStickerAttributeBySlotIndexFloat(thisptr, iSlot, iAttribute, flUnknown);

	int iID = *pItem->GetItemDefinitionIndex();
	if (!Settings::Aimbot::weapon_aim_settings[iWeaponID].StickersEnabled)
		return oGetStickerAttributeBySlotIndexFloat(thisptr, iSlot, iAttribute, flUnknown);

	switch (iAttribute)
	{
	case EStickerAttributeType::Wear:
		return min(1.f, Settings::Aimbot::weapon_aim_settings[iWeaponID].Stickers[iSlot].flWear + 0.0000000001f);
	case EStickerAttributeType::Scale:
		return 1.f;
	case EStickerAttributeType::Rotation:
		return Settings::Aimbot::weapon_aim_settings[iWeaponID].Stickers[iSlot].iRotation;
	default:
		break;
	}
	return oGetStickerAttributeBySlotIndexFloat(thisptr, iSlot, iAttribute, flUnknown);
}

typedef UINT(__thiscall* GetStickerAttributeBySlotIndexIntFn)(void*, int, EStickerAttributeType, float);
GetStickerAttributeBySlotIndexIntFn oGetStickerAttributeBySlotIndexInt;

UINT __fastcall Hooked_GetStickerAttributeBySlotIndexInt(void* thisptr, void* edx, int iSlot, EStickerAttributeType iAttribute, UINT iUnknown)
{
	auto pItem = reinterpret_cast<CBaseAttributableItem*>(uintptr_t(thisptr) - dwEconItemInterfaceWrapper);
	if (!pItem)
		return oGetStickerAttributeBySlotIndexInt(thisptr, iSlot, iAttribute, iUnknown);

	int iID = *pItem->GetItemDefinitionIndex();
	if (!Settings::Aimbot::weapon_aim_settings[iWeaponID].StickersEnabled)
		return oGetStickerAttributeBySlotIndexInt(thisptr, iSlot, iAttribute, iUnknown);

	if (iAttribute == EStickerAttributeType::Index)
		return k_stickers.at(Settings::Aimbot::weapon_aim_settings[iWeaponID].Stickers[iSlot].iID).id;

	return oGetStickerAttributeBySlotIndexInt(thisptr, iSlot, iAttribute, iUnknown);
}
void ApplyStickers(CBaseAttributableItem* pItem)
{
	void**& vmt = *reinterpret_cast<void***>(uintptr_t(pItem) + dwEconItemInterfaceWrapper);

	static void** hooked_vmt = nullptr;
	if (!hooked_vmt)
	{
		size_t size = 0;

		while (IsCodePtr(vmt[size]))
			++size;

		hooked_vmt = new void*[size];
		memcpy(hooked_vmt, vmt, size * sizeof(void*));

		oGetStickerAttributeBySlotIndexFloat = (GetStickerAttributeBySlotIndexFloatFn)hooked_vmt[4];
		hooked_vmt[4] = reinterpret_cast<void*>(&Hooked_GetStickerAttributeBySlotIndexFloat);

		oGetStickerAttributeBySlotIndexInt = (GetStickerAttributeBySlotIndexIntFn)hooked_vmt[5];
		hooked_vmt[5] = reinterpret_cast<void*>(&Hooked_GetStickerAttributeBySlotIndexInt);
	}
	vmt = hooked_vmt;
}

void Skin_OnFrameStageNotify(ClientFrameStage_t Stage)
{
	if (Stage == ClientFrameStage_t::FRAME_NET_UPDATE_POSTDATAUPDATE_START)
	{
		int nLocalPlayerID = Interfaces::Engine()->GetLocalPlayer();

		CBaseEntity* pLocal = (CBaseEntity*)Interfaces::EntityList()->GetClientEntity(nLocalPlayerID);

		if (!pLocal || pLocal->IsDead())
			return;

		UINT* hWeapons = pLocal->GetWeapons();

		if (!hWeapons)
			return;

		PlayerInfo LocalPlayerInfo;
		Interfaces::Engine()->GetPlayerInfo(nLocalPlayerID, &LocalPlayerInfo);

		for (int nIndex = 0; hWeapons[nIndex]; nIndex++)
		{
			CBaseAttributableItem* pWeapon = (CBaseAttributableItem*)Interfaces::EntityList()->GetClientEntityFromHandle(
				(PVOID)hWeapons[nIndex]);

			CBaseViewModel* pView = pWeapon->GetViewModel();

			if (!pWeapon)
				continue;

			int nWeaponIndex = *pWeapon->GetItemDefinitionIndex();

			if (g_ViewModelCfg.find(pView->GetModelIndex()) != g_ViewModelCfg.end())
				pView->SetModelIndex(Interfaces::ModelInfo()->GetModelIndex(g_ViewModelCfg[pView->GetModelIndex()]));

			if (Client::g_pSkin)
				Client::g_pSkin->ApplyCustomModel(pLocal, pWeapon);

			if (LocalPlayerInfo.m_nXuidLow != *pWeapon->GetOriginalOwnerXuidLow())
				continue;

			if (LocalPlayerInfo.m_nXuidHigh != *pWeapon->GetOriginalOwnerXuidHigh())
				continue;

			if (Client::g_pSkin)
				Client::g_pSkin->ApplyCustomSkin(pWeapon, nWeaponIndex);

			*pWeapon->GetAccountID() = LocalPlayerInfo.m_nXuidLow;
		}
	}
}

void Gloves_OnFrameStageNotify(ClientFrameStage_t Stage)
{
	if (!Settings::Skin::gloves_skin)
		return;

	if (Stage != ClientFrameStage_t::FRAME_NET_UPDATE_POSTDATAUPDATE_START)
		return;

	if (!IsLocalAlive())
		return;

	CBaseEntity* pLocal = g_pPlayers->GetLocal()->m_pEntity;

	UINT* pWeapons = pLocal->GetWeapons();

	if (!pWeapons)
		return;

	UINT* pWareables = pLocal->GetWearables();

	if (!Interfaces::EntityList()->GetClientEntityFromHandle((PVOID)pWareables[0]))
	{
		for (ClientClass* pClass = Interfaces::Client()->GetAllClasses(); pClass; pClass = pClass->m_pNext)
		{
			if (pClass->m_ClassID == (int)CLIENT_CLASS_ID::CEconWearable)
			{
				int iEntry = Interfaces::EntityList()->GetHighestEntityIndex() + 1;
				int iSerial = CSX::Utils::RandomIntRange(0x0, 0xFFF);

				if (pClass->m_pCreateFn(iEntry, iSerial))
				{
					pWareables[0] = iEntry | (iSerial << 16);
					break;
				}
			}
		}

		if (!pWareables[0])
			return;

		CBaseAttributableItem* pGlove = (CBaseAttributableItem*)Interfaces::EntityList()->GetClientEntityFromHandle((PVOID)pWareables[0]);

		if (!pGlove)
			return;

		PlayerInfo LocalPlayerInfo;

		if (!Interfaces::Engine()->GetPlayerInfo(Interfaces::Engine()->GetLocalPlayer(), &LocalPlayerInfo))
			return;

		*pGlove->GetItemDefinitionIndex() = GlovesSkin_Array[Settings::Skin::gloves_skin - 1].ItemIndex;
		*pGlove->GetItemIDHigh() = -1;
		*pGlove->GetEntityQuality() = 4;
		*pGlove->GetAccountID() = LocalPlayerInfo.m_nXuidLow;
		*pGlove->GetFallbackWear() = 0.00000001f;
		*pGlove->GetFallbackSeed() = 0;
		*pGlove->GetFallbackStatTrak() = -1;
		*pGlove->GetFallbackPaintKit() = GlovesSkin_Array[Settings::Skin::gloves_skin - 1].PaintKit;

		int ModelIndex = Interfaces::ModelInfo()->GetModelIndex(
			GlovesSkin_Array[Settings::Skin::gloves_skin - 1].szModel);

		if (!ModelIndex)
			return;

		if (pGlove->GetViewModel())
			pGlove->GetViewModel()->SetModelIndex(ModelIndex);

		if (pGlove->GetClientNetworkable())
			pGlove->GetClientNetworkable()->PreDataUpdate(DATA_UPDATE_CREATED);
	}
}

void Hook_SetViewModelSequence(const CRecvProxyData *pDataConst, void *pStruct, void *pOut)
{
	CRecvProxyData* pData = const_cast<CRecvProxyData*>(pDataConst);
	CBaseViewModel* pViewModel = (CBaseViewModel*)pStruct;

	if (pViewModel)
	{
		IClientEntity* pOwner = Interfaces::EntityList()->GetClientEntityFromHandle((PVOID)pViewModel->GetOwner());

		if (pOwner && pOwner->EntIndex() == Interfaces::Engine()->GetLocalPlayer())
		{
			const model_t* pModel = Interfaces::ModelInfo()->GetModel(pViewModel->GetModelIndex());
			const char* szModel = Interfaces::ModelInfo()->GetModelName(pModel);

			int m_nSequence = pData->m_Value.m_Int;
			//[junk_disable /]
			if (!strcmp(szModel, "models/weapons/v_knife_butterfly.mdl"))
			{
				switch (m_nSequence)
				{
				case SEQUENCE_DEFAULT_DRAW:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_BUTTERFLY_DRAW, SEQUENCE_BUTTERFLY_DRAW2); break;
				case SEQUENCE_DEFAULT_LOOKAT01:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_BUTTERFLY_LOOKAT01, SEQUENCE_BUTTERFLY_LOOKAT03); break;
				default:
					m_nSequence++;
				}
			}
			else if (!strcmp(szModel, "models/weapons/v_knife_falchion_advanced.mdl"))
			{
				// Fix animations for the Falchion Knife.
				switch (m_nSequence)
				{
				case SEQUENCE_DEFAULT_IDLE2:
					m_nSequence = SEQUENCE_FALCHION_IDLE1; break;
				case SEQUENCE_DEFAULT_HEAVY_MISS1:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_FALCHION_HEAVY_MISS1, SEQUENCE_FALCHION_HEAVY_MISS1_NOFLIP); break;
				case SEQUENCE_DEFAULT_LOOKAT01:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_FALCHION_LOOKAT01, SEQUENCE_FALCHION_LOOKAT02); break;
				case SEQUENCE_DEFAULT_DRAW:
				case SEQUENCE_DEFAULT_IDLE1:
					break;
				default:
					m_nSequence--;
				}
			}
			else if (!strcmp(szModel, "models/weapons/v_knife_push.mdl"))
			{
				// Fix animations for the Shadow Daggers.
				switch (m_nSequence)
				{
				case SEQUENCE_DEFAULT_IDLE2:
					m_nSequence = SEQUENCE_DAGGERS_IDLE1; break;
				case SEQUENCE_DEFAULT_LIGHT_MISS1:
				case SEQUENCE_DEFAULT_LIGHT_MISS2:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_DAGGERS_LIGHT_MISS1, SEQUENCE_DAGGERS_LIGHT_MISS5); break;
				case SEQUENCE_DEFAULT_HEAVY_MISS1:
					m_nSequence = CSX::Utils::RandomIntRange(SEQUENCE_DAGGERS_HEAVY_MISS2, SEQUENCE_DAGGERS_HEAVY_MISS1); break;
				case SEQUENCE_DEFAULT_HEAVY_HIT1:
				case SEQUENCE_DEFAULT_HEAVY_BACKSTAB:
				case SEQUENCE_DEFAULT_LOOKAT01:
					m_nSequence += 3; break;
				case SEQUENCE_DEFAULT_DRAW:
				case SEQUENCE_DEFAULT_IDLE1:
					break;
				default:
					m_nSequence += 2;
				}
			}
			else if (!strcmp(szModel, "models/weapons/v_knife_survival_bowie.mdl"))
			{
				switch (m_nSequence)
				{
				case SEQUENCE_DEFAULT_DRAW:
				case SEQUENCE_DEFAULT_IDLE1:
					break;
				case SEQUENCE_DEFAULT_IDLE2:
					m_nSequence = SEQUENCE_BOWIE_IDLE1; break;
				default:
					m_nSequence--;
				}
			}
			//[junk_enable /]
			pData->m_Value.m_Int = m_nSequence;
		}
	}

	fnSequenceProxyFn(pData, pStruct, pOut);
}

std::deque<Kit_t> k_skins;
std::deque<Kit_t> k_gloves;
std::deque<Kit_t> k_stickers;

class CCStrike15ItemSchema;
class CCStrike15ItemSystem;

template <typename Key, typename Value>
struct Node_t
{
	int previous_id;		//0x0000
	int next_id;			//0x0004
	void* _unknown_ptr;		//0x0008
	int _unknown;			//0x000C
	Key key;				//0x0010
	Value value;			//0x0014
};

template <typename Key, typename Value>
struct Head_t
{
	Node_t<Key, Value>* memory;		//0x0000
	int allocation_count;			//0x0004
	int grow_size;					//0x0008
	int start_element;				//0x000C
	int next_available;				//0x0010
	int _unknown;					//0x0014
	int last_element;				//0x0018
}; //Size=0x001C

   // could use CUtlString but this is just easier and CUtlString isn't needed anywhere else
struct String_t
{
	char* buffer;	//0x0000
	int capacity;	//0x0004
	int grow_size;	//0x0008
	int length;		//0x000C
}; //Size=0x0010

struct CPaintKit
{
	int id;						//0x0000

	String_t name;				//0x0004
	String_t description;		//0x0014
	String_t item_name;			//0x0024
	String_t material_name;		//0x0034
	String_t image_inventory;	//0x0044

	char pad_0x0054[0x8C];		//0x0054
}; //Size=0x00E0

struct CStickerKit
{
	int id;

	int item_rarity;

	String_t name;
	String_t description;
	String_t item_name;
	String_t material_name;
	String_t image_inventory;

	int tournament_event_id;
	int tournament_team_id;
	int tournament_player_id;
	bool is_custom_sticker_material;

	float rotate_end;
	float rotate_start;

	float scale_min;
	float scale_max;

	float wear_min;
	float wear_max;

	String_t image_inventory2;
	String_t image_inventory_large;

	uint32_t pad0[4];
};


void InitializeKits()
{
	static std::wstring_convert<std::codecvt_utf8_utf16<wchar_t>> converter;

	// Search the relative calls

	// call    ItemSystem
	// push    dword ptr [esi+0Ch]
	// lea     ecx, [eax+4]
	// call    CEconItemSchema::GetPaintKitDefinition

	auto sig_address = CSX::Memory::FindPBYTEPattern("client.dll", (PBYTE)"\xE8\x00\x00\x00\x00\xFF\x76\x0C\x8D\x48\x04\xE8", "x????xxxxxxx", NULL, NULL);

	// Skip the opcode, read rel32 address
